// Лабораторная 1
// Перевести узлы в километры в час и выразить в метрах в секунду
#include <iostream>

using namespace std;

int main() {

    cout << "Введите количество узлов:";
    cin >> knots;
    // 1 узел = 1.852 км/ч
    cout << "Ответ." << endl;
    printf("%f км/ч, %f м/с", (float)knots * 1.852, ((float)knots * 1.852 * 1000.0) / 3600.0);

}

// Лабораторная 2
// Написать программу,
// которая вычисляет среднее арифметическое элементов массива без учета минимального и максимального элементов массива.
// Массив и его длина вводятся пользователем.
#include <iostream>

using namespace std;

int main() {

    int charArrayLength;
    cout << "Укажите количество элементов в массиве:";
    cin >> charArrayLength;

    // задание элементов в массив
    int nums[charArrayLength];
    for (int i = 0; i < charArrayLength; i++) {
        cout << "Введите число для элемента №" << i+1 << ":";
        cin >> nums[i];
    }

    // поиск минимального и максимального элемента
    int minElement = nums[0], maxElement = nums[0];
    for (int i = 0; i < charArrayLength; i++) {
        if (nums[i] < minElement) {
            minElement = nums[i];
        }
        if (nums[i] > maxElement) {
            maxElement = nums[i];
        }
    }

    int sum, counter;
    for (int i = 0; i < charArrayLength; i++) {
        if (nums[i] != minElement && nums[i] != maxElement) {
            counter++;
            sum += nums[i];
        }
    }

    cout << "Ответ." << endl << double(sum) / double(counter);
}


// Лабораторная 3
// Написать программу, которая во вводимом с клавиатуры тексте выберет слова, начинающиеся с гласной буквы, и выведет их на экран. 

#include <iostream>

using namespace std;

int main() {
    
    char text[1024];
    cout << "Введите текст.\nПоддерживаются русские и английские символы\nДля ввода доступно не более 1024 символов\n";
    cin.get(text, 1024);
    cout << endl;
    cout << "Ответ." << endl;
    for (int i = 0; i < 1024; i++) {
        int temp = (int)text[i];
        if (text[i] == '\0') {
            break;
        }

        if ((temp <= -97 && temp >= -128) || (temp <= 90 && temp >= 65)) {
            
            while (text[i] != ' ') {

                if (text[i] == '\0') {
                    break;
                }
                cout << text[i];
                i++;
            }
            
            cout << " ";
        }

        else {
            while (text[i] != ' ') {

                if (text[i] == '\0') {
                    break;
                }
                i++;
                continue;
            }
        }

    }
    // -128 --- -97 (А-Я)   65 --- 90 (A-Z)
}
