// Лабораторная 1
// Перевести узлы в километры в час и выразить в метрах в секунду
#include <iostream>
#include <Windows.h>

using namespace std;

int main() {

    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);

    cout << "Введите количество узлов:";
    cin >> knots;
    // 1 узел = 1.852 км/ч
    cout << "Ответ." << endl;
    printf("%f км/ч, %f м/с", (float)knots * 1.852, ((float)knots * 1.852 * 1000.0) / 3600.0);

}

// Лабораторная 2
// Написать программу,
// которая вычисляет среднее арифметическое элементов массива без учета минимального и максимального элементов массива.
// Массив и его длина вводятся пользователем.
#include <iostream>
#include <Windows.h>

using namespace std;

int main() {
    
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    
    int charArrayLength;
    cout << "Укажите количество элементов в массиве:";
    cin >> charArrayLength;

    // задание элементов в массив
    int nums[charArrayLength];
    for (int i = 0; i < charArrayLength; i++) {
        cout << "Введите число для элемента №" << i+1 << ":";
        cin >> nums[i];
    }

    // поиск минимального и максимального элемента
    int minElement = nums[0], maxElement = nums[0];
    for (int i = 0; i < charArrayLength; i++) {
        if (nums[i] < minElement) {
            minElement = nums[i];
        }
        if (nums[i] > maxElement) {
            maxElement = nums[i];
        }
    }

    int sum, counter;
    for (int i = 0; i < charArrayLength; i++) {
        if (nums[i] != minElement && nums[i] != maxElement) {
            counter++;
            sum += nums[i];
        }
    }

    cout << "Ответ." << endl << double(sum) / double(counter);
}


// Лабораторная 3
// Написать программу, которая во вводимом с клавиатуры тексте выберет слова, начинающиеся с гласной буквы, и выведет их на экран. 

#include <iostream>
#include <Windows.h>

using namespace std;

int main() {

    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);

    char text[1024];
    cout << "Поддерживаются только русские и английские символы\nДля ввода доступно не более 1024 символов\nВведите текст: ";
    cin.get(text, 1024);
    cout << "Ответ." << endl;
    for (int i = 0; i < 1024; i++) {
        int temp = (int)text[i];
        if (text[i] == '\0') {
            break;
        }
        // -128 --- -97 (А-Я)   65 --- 90 (A-Z)
        if ((temp <= -97 && temp >= -128) || (temp <= 90 && temp >= 65)) {

            while (text[i] != ' ') {

                if (text[i] == '\0') {
                    break;
                }
                cout << text[i];
                i++;
            }

            cout << " ";
        }

        else {
            while (text[i] != ' ') {

                if (text[i] == '\0') {
                    break;
                }
                i++;
                continue;
            }
        }

    }
}







// Лабораторная 4
// Практическую часть к лабораторной работе 4 необходимо взять из лабораторной работы 3, дополнив ее некоторыми условиями:
// • входными данными является файл;
// • результаты работы записываются в другой файл;
// • входные данные не ограничиваются одной строкой.


#include <iostream>
#include <Windows.h>

using namespace std;

void main() {

    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);

    cout << "Поддерживаются только русские и английские символы\nДля ввода доступно не более 1024 символов\nНачинаю сканировать файл...\n";

    FILE* inputFile;
    FILE* outputFile;

    fopen_s(&inputFile, "input.txt", "r");
    fopen_s(&outputFile, "output.txt", "a");

    char* text = new char[1024];

    if (inputFile == NULL || outputFile == NULL) {
        cout << "Ошибка, не найден(ы) файл(ы) для работы программы!";
    }

    else {
        char text[1024];
        while (!feof(inputFile)) {

            
            fscanf_s(inputFile, "%[^\n]\n", text, 1024);


            for (int i = 0, j = 0; i < 1024; i++) {
                if (text[i] == '\0') {
                    break;
                }
                // -128 --- -97 (А-Я)   65 --- 90 (A-Z)
                if (((int)text[i] <= -97 && (int)text[i] >= -128) || ((int)text[i] <= 90 && (int)text[i] >= 65)) {

                    while (text[i] != ' ') {

                        if (text[i] == '\0') {
                            break;
                        }
                        fputc(text[i], outputFile);

                        i++;
                    }
                    fputc(' ', outputFile);

                }

                else {
                    while (text[i] != ' ') {
                        if (text[i] == '\0') {
                            break;
                        }
                        i++;
                        continue;
                    }
                }
            }
            fputc('\n', outputFile);
        }
        cout << "Готово! Результат сохранён в output.txt";
        fclose(outputFile);
        fclose(inputFile);
    }
}
